       IDENTIFICATION DIVISION.

       PROGRAM-ID. GREET.

       PROCEDURE DIVISION.
           DISPLAY "Hello world! and welcome to COBOL".
           STOP RUN.
           