       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.

       PROCEDURE DIVISION.
           DISPLAY 'Hello, World!'.
           STOP RUN.

      *Comments start here to compile
      * cobc -x -o helloworld helloworld.cob
      * then ./thefilename and you just ran your first cobol program!
