       IDENTIFICATION DIVISION.
       PROGRAM-ID. BLASTOFF.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNTING PIC 99 VALUE 10.

       PROCEDURE DIVISION.
           PERFORM UNTIL COUNTING = 0
           DISPLAY "Count: " COUNTING
           SUBTRACT 1 FROM COUNTING
           END-PERFORM.
           DISPLAY "BLAST OFF!!!!!!!".
           STOP RUN.
