       IDENTIFICATION DIVISION.
       PROGRAM-ID. FizzBuzzProgram.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  fizz_total PIC 9(4).

       PROCEDURE DIVISION.
           DISPLAY "Enter the total number for FizzBuzz: "
